Revit 2027 API
BuiltInFailures.DesignOptionFailures.BadReferenceBetweenOptionsWarn Property
 An element may not reference an element in another Option of the same Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadReferenceBetweenOptionsWarn { get; }
Public Shared ReadOnly Property BadReferenceBetweenOptionsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadReferenceBetweenOptionsWarn {
	FailureDefinitionId^ get ();
}
static member BadReferenceBetweenOptionsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace